app/controllers/api/v1/movies_controller.rb

	def create
	  @movie=Movie.new(movie_params)
	  if @movie.save
---
INSERT INTO "movies" ("tittle", "year", "rating", "language", "actors", "director", "producer", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"