app/controllers/api/v1/users_controller.rb

	def create
	  @user=User.new(user_params)
	  if @user.save
---
INSERT INTO "users" ("name", "age", "role", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Arnie"], ["age", 43], ["role", "Producer"], ["gender", "Male"], ["created_at", "2016-11-03 09:56:59.886350"], ["updated_at", "2016-11-03 09:56:59.886350"]]